IDEA Open Model
NumberGroups.CreateGroups Method (Double[])
Compatible with IDEA StatiCa Beta 20.0
 Creates new instance with groups with with one value in group.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static NumberGroups CreateGroups(
	params double[] positions
)
Public Shared Function CreateGroups (
	ParamArray positions As Double()
) As NumberGroups
Parameters
positions
Type: System.Double[]
The sequence of numbers to create groups.
Return Value
Type: NumberGroups
A new instance of groups.
See Also
Reference
NumberGroups Class
CreateGroups Overload
IdeaRS.OpenModel.Parameters Namespace